cmsis-svd/cmsis-svd/data/Spansion/MB9AF13xM.svd
        <!-- REGISTER "ADST1" -->
        <register>
          <name>ADST1</name>
          <description>Sampling Time Setup Register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX1" -->
            <field>
              <name>STX1</name>
              <description>Sampling time N times setting bits</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description>Sampling time setting bits</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADST0" -->
        <register>
          <name>ADST0</name>
          <description>Sampling Time Setup Register 0</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX0" -->
            <field>
              <name>STX0</name>
              <description>Sampling time N times setting bits </description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description>Sampling time setting bits</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCT" -->
        <register>
          <name>ADCT</name>
          <description>Comparison Time Setup Register</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x07</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CT" -->
            <field>
              <name>CT</name>
              <description>Compare clock frequency division ratio setting bits</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRTSL" -->
        <register>
          <name>PRTSL</name>
          <description>Priority Conversion Timer Trigger Selection Register</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRTSL" -->
            <field>
              <name>PRTSL</name>
              <description>Priority conversion timer trigger selection bit </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCTSL" -->
        <register>
          <name>SCTSL</name>
          <description>Scan Conversion Timer Trigger Selection Register</description>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCTSL" -->
            <field>
              <name>SCTSL</name>
              <description>Scan conversion timer trigger selection bit </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCEN" -->
        <register>
          <name>ADCEN</name>
          <description>A/D Operation Enable Setup Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFF00</resetValue>
          <resetMask>0xFF03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ENBLTIME" -->
            <field>
              <name>ENBLTIME</name>
              <description>Basic cycle selection bit </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "READY" -->
            <field>
              <name>READY</name>
              <description>A/D operation enable state bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ENBL" -->
            <field>
              <name>ENBL</name>
              <description>A/D operation enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DAC" -->
    <peripheral>
      <name>DAC</name>
      <description>D/A Converter</description>
      <groupName>DAC</groupName>
      <baseAddress>0x40028000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "DADR0" -->
        <register>
          <name>DADR0</name>
          <description>D/A Data Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DA9" -->
            <field>
              <name>DA9</name>
              <description>Bit9 of DADR0</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA8" -->
            <field>
              <name>DA8</name>
              <description>Bit8 of DADR0</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA7" -->
            <field>
              <name>DA7</name>
              <description>Bit7 of DADR0</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA6" -->
            <field>
              <name>DA6</name>
              <description>Bit6 of DADR0</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA5" -->
            <field>
              <name>DA5</name>
              <description>Bit5 of DADR0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA4" -->
            <field>
              <name>DA4</name>
              <description>Bit4 of DADR0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA3" -->
            <field>
              <name>DA3</name>
              <description>Bit3 of DADR0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA2" -->
            <field>
              <name>DA2</name>
              <description>Bit2 of DADR0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA1" -->
            <field>
              <name>DA1</name>
              <description>Bit1 of DADR0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA0" -->
            <field>
              <name>DA0</name>
              <description>Bit0 of DADR0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DACR0" -->
        <register>
          <name>DACR0</name>
          <description>D/A Control Register</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DAE" -->
            <field>
              <name>DAE</name>
              <description>D/A converter operation enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DADR1" -->
        <register>
          <name>DADR1</name>
          <description>D/A Data Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DA9" -->
            <field>
              <name>DA9</name>
              <description>Bit9 of DADR1</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA8" -->
            <field>
              <name>DA8</name>
              <description>Bit8 of DADR1</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA7" -->
            <field>
              <name>DA7</name>
              <description>Bit7 of DADR1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA6" -->
            <field>
              <name>DA6</name>
              <description>Bit6 of DADR1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA5" -->
            <field>
              <name>DA5</name>
              <description>Bit5 of DADR1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA4" -->
            <field>
              <name>DA4</name>
              <description>Bit4 of DADR1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA3" -->
            <field>
              <name>DA3</name>
              <description>Bit3 of DADR1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA2" -->
            <field>
              <name>DA2</name>
              <description>Bit2 of DADR1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA1" -->
            <field>
              <name>DA1</name>
              <description>Bit1 of DADR1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA0" -->
            <field>
              <name>DA0</name>
              <description>Bit0 of DADR1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DACR1" -->
        <register>
          <name>DACR1</name>
          <description>D/A Control Register</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DAE" -->
            <field>
              <name>DAE</name>
              <description>D/A converter operation enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
