cmsis-svd/cmsis-svd/data/Spansion/MB9AF13xM.svd
        <!-- REGISTER "WTDIV" -->
        <register>
          <name>WTDIV</name>
          <description>Divider Ratio Setting Register</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTDIV" -->
            <field>
              <name>WTDIV</name>
              <description>Divider ratio</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDIVEN" -->
        <register>
          <name>WTDIVEN</name>
          <description>Divider Output Enable Register</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTDIVRDY" -->
            <field>
              <name>WTDIVRDY</name>
              <description>Divider status bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WTDIVEN" -->
            <field>
              <name>WTDIVEN</name>
              <description>Divider enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCALPRD" -->
        <register>
          <name>WTCALPRD</name>
          <description>Frequency Correction Cycle Setting Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x13</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCALPRD" -->
            <field>
              <name>WTCALPRD</name>
              <description>frequency correction value</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCOSEL" -->
        <register>
          <name>WTCOSEL</name>
          <description>RTCCO Output Selection Register</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCOSEL" -->
            <field>
              <name>WTCOSEL</name>
              <description>RTCCO output selection bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>
